#+TITLE: Nix flake
#+CREATED: [2022-12-25 Sun 22:14]
#+PROPERTY: header-args :mkdirp yes
#+LAST_MODIFIED: [2023-06-20 Tue 23:46 EDT]

At the root of my [[https://github.com/rossabaker/cromulent][cromulent repository]] is a [[https://nixos.wiki/wiki/Flakes][Nix flake]].  It contains
all my system configurations, home environment configurations,
packages, development shells, and more.

* What's in the flake
:PROPERTIES:
:CUSTOM_ID: what's-in-the-flake
:END:

My flake currently performs [[https://nixos.wiki/wiki/Import_From_Derivation][Import From Deriviation]], but I'm trying to
remove it.  For now, we need to explicitly allow it to see the
contents of my flake.

#+name: flake-show-outputs
#+begin_src sh :eval yes :exports code :results output verbatim
  nix --option allow-import-from-derivation true flake show github:rossabaker/cromulent
#+end_src

#+RESULTS: flake-show-outputs
#+begin_example
[1mgithub:rossabaker/cromulent/a979838336d80960216b73fff7165378157fbc7c[0m
[32;1m├───[0m[1mapps[0m
[32;1m│   ├───[0m[1maarch64-darwin[0m
[32;1m│   │   └───[0m[1memacs[0m: app
[32;1m│   └───[0m[1mx86_64-linux[0m
[32;1m│       └───[0m[1memacs[0m: app
[32;1m├───[0m[1mchecks[0m
[32;1m│   ├───[0m[1maarch64-darwin[0m
[32;1m│   └───[0m[1mx86_64-linux[0m
[32;1m├───[0m[1mdarwinConfigurationModules[0m: [35;1munknown[0m
[32;1m├───[0m[1mdevShells[0m
[32;1m│   ├───[0m[1maarch64-darwin[0m
[32;1m│   │   └───[0m[1mdefault[0m: development environment 'nix-config'
[32;1m│   └───[0m[1mx86_64-linux[0m
[32;1m│       └───[0m[1mdefault[0m: development environment 'nix-config'
[32;1m├───[0m[1mflakeModules[0m: [35;1munknown[0m
[32;1m├───[0m[1mformatter[0m
[32;1m├───[0m[1mhomeConfigurations[0m: [35;1munknown[0m
[32;1m├───[0m[1mhomeManagerModules[0m: [35;1munknown[0m
[32;1m├───[0m[1mlegacyPackages[0m
[32;1m│   ├───[0m[1maarch64-darwin[0m [35;1momitted[0m (use '--legacy' to show)
[32;1m│   └───[0m[1mx86_64-linux[0m [35;1momitted[0m (use '--legacy' to show)
[32;1m├───[0m[1mnixosConfigurations[0m
[32;1m├───[0m[1mnixosModules[0m
[32;1m├───[0m[1moverlays[0m
[32;1m│   ├───[0m[1mdefault[0m: [35;1mNixpkgs overlay[0m
[32;1m│   ├───[0m[1mdevshell[0m: [35;1mNixpkgs overlay[0m
[32;1m│   └───[0m[1memacs[0m: [35;1mNixpkgs overlay[0m
[32;1m└───[0m[1mpackages[0m
[32;1m    ├───[0m[1maarch64-darwin[0m
[32;1m    │   ├───[0m[1m"RABaker@L2LYQM57XY"[0m: package 'home-manager-generation'
[32;1m    │   ├───[0m[1maarch64-darwin-config-base[0m: package 'darwin-system-22.11.20230528.c8a17ce+darwin4.b8c286c'
[32;1m    │   ├───[0m[1memacs-ross[0m: package 'emacs29-with-packages-'
[32;1m    │   ├───[0m[1memacs29[0m: package 'emacs29'
[32;1m    │   └───[0m[1mwebsite[0m: package 'rossabaker.com'
[32;1m    └───[0m[1mx86_64-linux[0m
[32;1m        ├───[0m[1memacs-ross[0m: package 'emacs29-with-packages-'
[32;1m        ├───[0m[1memacs29[0m: package 'emacs29'
[32;1m        └───[0m[1mwebsite[0m: package 'rossabaker.com'
#+end_example

#+begin_details
#+begin_summary
  Results
#+end_summary

#+begin_src emacs-lisp :eval yes :var in=flake-show-outputs() :exports results
  (ansi-color-filter-apply in)
#+end_src

#+RESULTS:
#+begin_example
github:rossabaker/cromulent/a979838336d80960216b73fff7165378157fbc7c
├───apps
│   ├───aarch64-darwin
│   │   └───emacs: app
│   └───x86_64-linux
│       └───emacs: app
├───checks
│   ├───aarch64-darwin
│   └───x86_64-linux
├───darwinConfigurationModules: unknown
├───devShells
│   ├───aarch64-darwin
│   │   └───default: development environment 'nix-config'
│   └───x86_64-linux
│       └───default: development environment 'nix-config'
├───flakeModules: unknown
├───formatter
├───homeConfigurations: unknown
├───homeManagerModules: unknown
├───legacyPackages
│   ├───aarch64-darwin omitted (use '--legacy' to show)
│   └───x86_64-linux omitted (use '--legacy' to show)
├───nixosConfigurations
├───nixosModules
├───overlays
│   ├───default: Nixpkgs overlay
│   ├───devshell: Nixpkgs overlay
│   └───emacs: Nixpkgs overlay
└───packages
    ├───aarch64-darwin
    │   ├───"RABaker@L2LYQM57XY": package 'home-manager-generation'
    │   ├───aarch64-darwin-config-base: package 'darwin-system-22.11.20230528.c8a17ce+darwin4.b8c286c'
    │   ├───emacs-ross: package 'emacs29-with-packages-'
    │   ├───emacs29: package 'emacs29'
    │   └───website: package 'rossabaker.com'
    └───x86_64-linux
        ├───emacs-ross: package 'emacs29-with-packages-'
        ├───emacs29: package 'emacs29'
        └───website: package 'rossabaker.com'
#+end_example

#+end_details

